app/Controllers/Main.php

    public function homepage()
    {
        $data = [
            'title' => 'Home',
            'homepage' => true,
            'profile' => false,
            'structure' => false,
            'facility' => false,
            'article' => false,
            'kapus' => $this->strukturModel->where('posisi', 'KAPUS')->first(),
            'katu' => $this->strukturModel->where('posisi', 'KASUBAG TU')->first()
---
SELECT *
FROM `struktur`
WHERE `posisi` = 'KAPUS'
 LIMIT 1
SELECT *
FROM `struktur`
WHERE `posisi` = 'KASUBAG TU'
 LIMIT 1